Catalogs/СоставПаллеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СоставПаллеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходныйОрдер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаданияНаРазборку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаданиеНаРазборку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СоставПаллеты/Ext/ManagerModule.bsl
Функция ПечатьШК(МассивСсылок) Экспорт
	
	ВнешняяКомпонента = Справочники.Номенклатура.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	Макет = Справочники.СоставПаллеты.ПолучитьМакет("Этикетка");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут КАК Маршрут,
	               |	МаршрутныйЛистРасходныеОрдера.Документ
	               |ИЗ
	               |	Документ.МаршрутныйЛист.РасходныеОрдера КАК МаршрутныйЛистРасходныеОрдера
	               |ГДЕ
	               |	МаршрутныйЛистРасходныеОрдера.Документ В(&Документ)
	               |	И МаршрутныйЛистРасходныеОрдера.Ссылка.ПометкаУдаления = ЛОЖЬ";
	МасРО=Новый Массив;
	Для каждого Эл Из МассивСсылок Цикл
		МасРО.Добавить(Эл.РасходныйОрдер);	
	КонецЦикла; 
	Запрос.УстановитьПараметр("Документ", МасРО);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Область = Макет.ПолучитьОбласть("Этикетка");
	ОбластьСтр = Макет.ПолучитьОбласть("Строка");
	ТабДокИтог = Новый ТабличныйДокумент();
	Для каждого Ссылка Из МассивСсылок Цикл
		Если ТипЗнч(Ссылка.РасходныйОрдер)=Тип("ДокументСсылка.РасходныйОрдерСклад") Тогда
			ШтрихКод = "850" + Прав("000000000000" + Формат(Ссылка.ИД, "ЧГ=0"), 12);
			ТабДок = Новый ТабличныйДокумент();
			
			УчаствуетВМаршруте = "";
			
			Если Выборка.НайтиСледующий(Новый Структура("Документ",Ссылка.РасходныйОрдер)) Тогда
				УчаствуетВМаршруте = Выборка.Маршрут.Наименование+" "+Выборка.Маршрут.ПолноеНаименование;
			КонецЕсли;	
			Выборка.Сбросить();
			Область.Параметры.ТорговаяТочка = Ссылка.РасходныйОрдер.Получатель;
			
			Область.Параметры.Паллета = "ИД "+Ссылка.ИД+" "+Строка(Ссылка.РасходныйОрдер)+Символы.ПС+?(Ссылка.РасходныйОрдер.Склад.ДляШтучногоТовара,"Коробка склада штучного товара "+Строка(Ссылка.РасходныйОрдер.Склад),"Маршрут: " + УчаствуетВМаршруте);
			
			Рисунок 					= Область.Рисунки["ШтрихКод"];
			
			ПараметрыШК = Новый Структура();
			ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
			ПараметрыШК.Вставить("Высота", Рисунок.Высота);
			ПараметрыШК.Вставить("ТипКода", 4);
			ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
			ПараметрыШК.Вставить("РазмерШрифта", 10);
			ПараметрыШК.Вставить("Штрихкод", Штрихкод);
			Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
			Область.Параметры.ШК = ШтрихКод;
			ТабДок.Вывести(Область);
			Для каждого Стр Из Ссылка.Состав Цикл
				ОбластьСтр.Параметры.Заполнить(Стр);
				ТабДок.Вывести(ОбластьСтр);
			КонецЦикла; 
			Если ТабДокИтог.ПроверитьВывод(ТабДок) Тогда
			     ТабДокИтог.Вывести(ТабДок);
			Иначе
			     ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
			     ТабДокИтог.Вывести(ТабДок);
			КонецЕсли; 
		Иначе	
			ШтрихКод = "850" + Прав("000000000000" + Формат(Ссылка.ИД, "ЧГ=0"), 12);
			ТабДок = Новый ТабличныйДокумент();
			
			Область.Параметры.ТорговаяТочка = "";
			
			Область.Параметры.Паллета = "ИД "+Ссылка.ИД+" "+Строка(Ссылка.РасходныйОрдер);
			
			Рисунок 					= Область.Рисунки["ШтрихКод"];
			
			ПараметрыШК = Новый Структура();
			ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
			ПараметрыШК.Вставить("Высота", Рисунок.Высота);
			ПараметрыШК.Вставить("ТипКода", 4);
			ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
			ПараметрыШК.Вставить("РазмерШрифта", 10);
			ПараметрыШК.Вставить("Штрихкод", Штрихкод);
			Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
			Область.Параметры.ШК = ШтрихКод;
			ТабДок.Вывести(Область);
			Для каждого Стр Из Ссылка.Состав Цикл
				ОбластьСтр.Параметры.Заполнить(Стр);
				ТабДок.Вывести(ОбластьСтр);
			КонецЦикла; 
			Если ТабДокИтог.ПроверитьВывод(ТабДок) Тогда
			     ТабДокИтог.Вывести(ТабДок);
			Иначе
			     ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
			     ТабДокИтог.Вывести(ТабДок);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	ТабДокИтог.КлючПараметровПечати = "ПараметрыПечати_ЭтикеткиУпаковки";
	Возврат ТабДокИтог;
	
КонецФункции
